Repository: SibghaBhatti/cotton-disease-web-app
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ur

source: Disease Alerts
ur: بیماری کی الرٹس

source: Disease Detection
ur: بیماری کی تشخیص

source: Weather Forecasting
ur: موسم کی پیشن گوئی

source: Chatbot
ur: چیٹ بوٹ

source: Fertilizer Calculator Simple
ur: سادہ کھاد کیلکولیٹر

source: Fertilizer Calculator
ur: کھاد کیلکولیٹر

source: Blog
ur: بلاگ

source: Best Cotton Seeds in Pakistan
ur: پاکستان میں بہترین کپاس کے بیج

source: Alerts
ur: الرٹس

source: News
ur: خبریں

source: Logout
ur: لاگ آوٹ

source: Leaf Spot Disease Alert
ur: پتے کی داغ کی بیماری کی الرٹ

source: Date:
ur: تاریخ:

source: Bacterial Blight Outbreak
ur: بیکٹیریل بلائٹ کی وبا

source: Fusarium Wilt Warning
ur: فیوزیریم ویلٹ کی وارننگ

source: Back to Dashboard
ur: ڈیش بورڈ پر واپس جائیں

source: Dashboard
ur: ڈیش بورڈ

source: English
ur: انگریزی

source: اردو
ur: Urdu

source: Latest Articles
ur: تازہ ترین مضامین

source: Load More
ur: مزید لوڈ کریں

source: The Importance of Sustainable Farming
ur: پائیدار زراعت کی اہمیت

source: Sustainable farming practices are essential for preserving our environment and ensuring long-term food security. By incorporating organic methods, crop rotation, and reduced chemical usage, farmers can maintain soil health and reduce water consumption. This approach not only benefits the planet but also improves the quality of the produce. Additionally, sustainable farming encourages biodiversity and reduces the risk of pest infestations. With growing awareness about environmental issues, consumers are increasingly seeking sustainably grown food. Implementing these practices leads to improved profitability and a resilient agricultural ecosystem. The transition to sustainable methods, although gradual, promises a healthier future for both farmers and the planet.
ur: پائیدار زرعی طریقے ہمارے ماحول کو محفوظ رکھنے اور طویل مدتی خوراک کی حفاظت کو یقینی بنانے کے لیے ضروری ہیں۔ نامیاتی طریقوں، فصل کی گردش، اور کیمیکلز کے استعمال کو کم کرنے سے کسان مٹی کی صحت کو برقرار رکھ سکتے ہیں اور پانی کی کھپت کو کم کر سکتے ہیں۔ یہ طریقہ نہ صرف سیارے کو فائدہ پہنچاتا ہے بلکہ پیداوار کے معیار کو بھی بہتر بناتا ہے۔ اس کے علاوہ، پائیدار زراعت حیاتیاتی تنوع کو فروغ دیتی ہے اور کیڑوں کے حملوں کے خطرے کو کم کرتی ہے۔ ماحولیاتی مسائل کے بارے میں بڑھتی ہوئی بیداری کے ساتھ، صارفین تیزی سے پائیدار طریقے سے اگائی گئی خوراک کی تلاش میں ہیں۔ ان طریقوں کو نافذ کرنے سے منافع میں بہتری اور ایک لچکدار زرعی ماحولیاتی نظام حاصل ہوتا ہے۔ پائیدار طریقوں کی طرف منتقلی، اگرچہ آہستہ آہستہ ہوتی ہے، کسانوں اور سیارے دونوں کے لیے ایک صحت مند مستقبل کا وعدہ کرتی ہے۔

source: Innovative Techniques in Modern Agriculture
ur: جدید زراعت میں اختراعی تکنیکیں

source: Modern agriculture is rapidly evolving with the integration of new technologies that enhance efficiency and productivity. Precision farming methods, drone surveillance, and automated irrigation systems are just a few examples transforming crop management. These innovations help monitor crop health, optimize resource usage, and significantly improve yields. Technology also empowers farmers to make data-driven decisions that minimize waste and environmental impact. As these techniques become more accessible, they pave the way for a more sustainable and profitable agricultural sector. The blend of traditional knowledge with modern innovation is setting new standards for efficiency in farming practices.
ur: جدید زراعت نئی ٹیکنالوجیز کے انضمام کے ساتھ تیزی سے ترقی کر رہی ہے جو کارکردگی اور پیداواریت کو بڑھاتی ہیں۔ درست کاشتکاری کے طریقے، ڈرون نگرانی، اور خودکار ایریگیشن سسٹم چند مثالیں ہیں جو فصل کے انتظام کو تبدیل کر رہی ہیں۔ یہ اختراعات فصل کی صحت کی نگرانی، وسائل کے استعمال کو بہتر بنانے، اور پیداوار میں نمایاں بہتری لانے میں مدد دیتی ہیں۔ ٹیکنالوجی کسانوں کو ڈیٹا پر مبنی فیصلے کرنے کی طاقت دیتی ہے جو فضلہ اور ماحولیاتی اثرات کو کم کرتی ہے۔ جیسے جیسے یہ تکنیکیں زیادہ قابل رسائی ہوتی جا رہی ہیں، وہ زیادہ پائیدار اور منافع بخش زرعی شعبے کی راہ ہموار کرتی ہیں۔ روایتی علم کا جدید اختراع کے ساتھ امتزاج زرعی طریقوں میں کارکردگی کے لیے نئے معیارات قائم کر رہا ہے۔

source: Embracing Organic Methods for a Healthier Future
ur: صحت مند مستقبل کے لیے نامیاتی طریقوں کو اپنانا

source: Organic farming is gaining popularity as more consumers look for chemical-free and nutritious food options. This approach relies on natural growth processes and avoids synthetic pesticides and fertilizers, thereby preserving soil quality and water purity. Organic methods promote biodiversity and support local ecosystems while delivering produce that is often richer in flavor and nutrients. Transitioning to organic practices can be challenging but offers long-term benefits for health and the environment. With increasing demand for organic products, farmers are motivated to adopt these sustainable practices, ensuring that both the land and its inhabitants thrive.
ur: نامیاتی زراعت تیزی سے مقبولیت حاصل کر رہی ہے کیونکہ زیادہ صارفین کیمیکل سے پاک اور غذائیت سے بھرپور خوراک کے اختیارات تلاش کر رہے ہیں۔ یہ طریقہ قدرتی نشوونما کے عمل پر انحصار کرتا ہے اور مصنوعی کیڑے مار ادویات اور کھادوں سے گریز کرتا ہے، اس طرح مٹی کے معیار اور پانی کی پاکیزگی کو محفوظ رکھتا ہے۔ نامیاتی طریقے حیاتیاتی تنوع کو فروغ دیتے ہیں اور مقامی ماحولیاتی نظام کی حمایت کرتے ہیں جبکہ ایسی پیداوار فراہم کرتے ہیں جو اکثر ذائقے اور غذائیت میں زیادہ بھرپور ہوتی ہے۔ نامیاتی طریقوں کی طرف منتقلی مشکل ہو سکتی ہے لیکن یہ صحت اور ماحول کے لیے طویل مدتی فوائد پیش کرتی ہے۔ نامیاتی مصنوعات کی بڑھتی ہوئی مانگ کے ساتھ، کسان ان پائیدار طریقوں کو اپنانے کی ترغیب پاتے ہیں، اس بات کو یقینی بناتے ہوئے کہ زمین اور اس کے باشندے دونوں ترقی کریں۔

source: Available Varieties
ur: دستیاب اقسام

source: Welcome,
ur: خوش آمدید،

source: Cotton Plant Disease Classifier
ur: کپاس کے پودوں کی بیماری کی درجہ بندی

source: Upload and Detect
ur: اپ لوڈ کریں اور پتہ لگائیں

source: Result:
ur: نتیجہ:

source: Detected Image
ur: پتہ چلائی گئی تصویر

source: Prevention and Control
ur: روک تھام اور کنٹرول

source: Monitor crops regularly for signs of infestation.
ur: کیڑے کی علامات کے لئے فصلوں کی باقاعدگی سے نگرانی کریں۔

source: Use pheromone traps to capture adult moths.
ur: بالغ کیڑے پکڑنے کے لئے فیرومون ٹریپ استعمال کریں۔

source: Apply appropriate insecticides as recommended.
ur: تجویز کردہ مناسب کیڑے مار ادویات کا استعمال کریں۔

source: Encourage natural predators and parasitoids.
ur: قدرتی شکاریوں اور پیراسائٹائڈز کو فروغ دیں۔

source: Plant resistant varieties if available.
ur: اگر دستیاب ہوں تو مزاحمتی اقسام لگائیں۔

source: Ensure good field sanitation by removing infected debris.
ur: متاثرہ ملبے کو ہٹا کر اچھے فیلڈ کی صفائی کو یقینی بنائیں۔

source: Apply fungicides as necessary.
ur: ضرورت کے مطابق فنگسائڈز کا استعمال کریں۔

source: Use natural predators like ladybugs.
ur: قدرتی شکاری جیسے لیڈی بگز استعمال کریں۔

source: Apply insecticidal soaps or oils.
ur: کیڑے مار صابن یا تیل لگائیں۔

source: Inspect crops regularly for signs of infestation.
ur: انفیکشن کے آثار کے لیے فصلوں کا باقاعدگی سے معائنہ کریں۔

source: Maintain good field sanitation and use mulches.
ur: اچھی فیلڈ صفائی برقرار رکھیں اور ملچس استعمال کریں۔

source: Apply appropriate herbicides if necessary.
ur: ضرورت کے مطابق مناسب جڑی بوٹی مار ادویات لگائیں۔

source: Use disease-free seeds.
ur: بیماری سے پاک بیج استعمال کریں۔

source: Rotate crops to avoid disease buildup.
ur: بیماری کے جمع ہونے سے بچنے کے لیے فصلوں کو گھمائیں۔

source: Your crop is healthy.
ur: آپ کی فصل صحت مند ہے۔

source: Remove and destroy infected plants.
ur: متاثرہ پودوں کو ہٹا کر تباہ کریں۔

source: Control insect vectors like whiteflies.
ur: کیڑوں کے ویکٹرز جیسے سفید مکھیوں کو کنٹرول کریں۔

source: Apply appropriate fungicides.
ur: مناسب فنگسائڈز لگائیں۔

source: Ensure proper drainage and field sanitation.
ur: مناسب نکاسی آب اور فیلڈ صفائی کو یقینی بنائیں۔

source: Red cotton bug is a pest causing damage to cotton crops.
ur: سرخ کپاس کا بگ ایک کیڑا ہے جو کپاس کی فصلوں کو نقصان پہنچاتا ہے۔

source: Field Area (in hectares):
ur: کھیت کا رقبہ (ہیکٹر میں):

source: Soil Type:
ur: مٹی کی قسم:

source: Alluvial
ur: بہل

source: Sandy
ur: ریتیلی

source: Clayey
ur: چکنی

source: Soil pH:
ur: مٹی کا پی ایچ:

source: Acidic (< 6.5)
ur: تیزابی (< 6.5)

source: Neutral (6.5 - 7.5)
ur: غیر جانبدار (6.5 - 7.5)

source: Alkaline (> 7.5)
ur: الکلین (> 7.5)

source: Organic Matter Content:
ur: نامیاتی مادے کی مقدار:

source: Low (< 2%)
ur: کم (< 2%)

source: Medium (2% - 4%)
ur: درمیانہ (2% - 4%)

source: High (> 4%)
ur: زیادہ (> 4%)

source: Previous Crop:
ur: پچھلی فصل:

source: Legumes (Nitrogen-fixing)
ur: پھلی دار (نائٹروجن فکسنگ)

source: Cereals (e.g., Wheat, Corn)
ur: اناج (مثلاً گندم، مکئی)

source: Fallow (No previous crop)
ur: بنجر (کوئی پچھلی فصل نہیں)

source: Cotton Growth Stage:
ur: کپاس کی نشوونما کا مرحلہ:

source: Early Growth
ur: ابتدائی نشوونما

source: Boll Development
ur: بول کی نشوونما

source: Pre-Harvest
ur: پہلے سے کٹائی

source: Irrigation Level (based on last year's monsoon):
ur: ایریگیشن لیول (پچھلے سال کے مانسون کی بنیاد پر):

source: Good Monsoon
ur: اچھا مانسون

source: Average Monsoon
ur: اوسط مانسون

source: Poor Monsoon
ur: ناقص مانسون

source: Calculate Fertilizer Needs
ur: کھاد کی ضروریات کا حساب لگائیں

source: Enter City:
ur: شہر داخل کریں:

source: Get Weather
ur: موسم حاصل کریں

source: Weather in
ur: موسم

source: Temperature:
ur: درجہ حرارت:

source: Pressure:
ur: دباؤ:

source: Humidity:
ur: نمی:

source: Description:
ur: تفصیل:

source: Weather icon
ur: موسم کا آئکن

source: Weather data not available.
ur: موسم کے اعداد و شمار دستیاب نہیں ہیں۔

source: Bt Cotton
ur: بی ٹی کاٹن

source: Bt cotton is genetically modified to produce an insecticide to combat bollworm.
ur: بی ٹی کاٹن جینیاتی طور پر ترمیم شدہ ہے تاکہ بول ورم کے خلاف انسیکٹی سائیڈ پیدا کر سکے۔

source: IR Cotton
ur: آئی آر کاٹن

source: IR cotton varieties are known for their resistance to certain pests and diseases.
ur: آئی آر کاٹن کی اقسام بعض کیڑوں اور بیماریوں کے خلاف مزاحمت کے لیے جانی جاتی ہیں۔

source: Desi Cotton
ur: دیسی کاٹن

source: Desi cotton varieties are traditional varieties that are well-suited to local growing conditions.
ur: دیسی کاٹن کی اقسام روایتی اقسام ہیں جو مقامی کاشت کے حالات کے لئے بہت موزوں ہیں۔

source: Hybrid Cotton
ur: ہائبرڈ کاٹن

source: Hybrid cotton varieties are bred to increase yield and improve fiber quality.
ur: ہائبرڈ کاٹن کی اقسام پیداوار بڑھانے اور فائبر کے معیار کو بہتر بنانے کے لئے پیدا کی گئی ہیں۔

source: Based on your inputs, your cotton field in Punjab requires approximately:<br>- Nitrogen: ${nitrogenTotal.toFixed(2)} kg<br>- Phosphorus: ${phosphorusTotal.toFixed(2)} kg<br>- Potassium: ${potassiumTotal.toFixed(2)} kg
ur: آپ کے ان پٹس کی بنیاد پر، پنجاب میں آپ کے کپاس کے کھیت کو تقریباً درکار ہے:<br>- نائٹروجن: ${nitrogenTotal.toFixed(2)} کلوگرام<br>- فاسفورس: ${phosphorusTotal.toFixed(2)} کلوگرام<br>- پوٹاشیم: ${potassiumTotal.toFixed(2)} کلوگرام

source: Area (acres)
ur: رقبہ (ایکڑ)

source: Enter the area
ur: رقبہ درج کریں

source: Nitrogen Requirement (kg/acre)
ur: نائٹروجن کی ضرورت (کلوگرام فی ایکڑ)

source: Enter the nitrogen requirement
ur: نائٹروجن کی ضرورت درج کریں

source: Phosphorus Requirement (kg/acre)
ur: فاسفورس کی ضرورت (کلوگرام فی ایکڑ)

source: Enter the phosphorus requirement
ur: فاسفورس کی ضرورت درج کریں

source: Potassium Requirement (kg/acre)
ur: پوٹاشیم کی ضرورت (کلوگرام فی ایکڑ)

source: Enter the potassium requirement
ur: پوٹاشیم کی ضرورت درج کریں

source: Calculate
ur: حساب کریں

source: Fertilizer Requirements
ur: کھاد کی ضروریات

source: Total Nitrogen: {0} kg
ur: کل نائٹروجن: {0} کلوگرام

source: Total Phosphorus: {0} kg
ur: کل فاسفورس: {0} کلوگرام

source: Total Potassium: {0} kg
ur: کل پوٹاشیم: {0} کلوگرام

source: © 2025 Expert Cotton Prediction. All Rights Reserved.
ur: © 2025 ایکسپرٹ کاٹن پیشن گوئی۔ جملہ حقوق محفوظ ہیں۔
